experiments/results/thesis/DPFS-NULL-pre/fio_randread_16k_64_4.out
"randread_16k_64_4": (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=io_uring, iodepth=64
...
fio-3.28
Starting 4 threads

"randread_16k_64_4": (groupid=0, jobs=4): err= 0: pid=134602: Wed Jul 19 01:43:58 2023
  read: IOPS=386k, BW=6038MiB/s (6331MB/s)(354GiB/60023msec)
    slat (usec): min=2, max=100, avg= 4.76, stdev= 1.65
    clat (usec): min=106, max=475889, avg=657.45, stdev=6961.90
     lat (usec): min=140, max=475896, avg=662.31, stdev=6961.86
    clat percentiles (usec):
     |  1.00th=[   172],  5.00th=[   176], 10.00th=[   178], 20.00th=[   180],
     | 30.00th=[   182], 40.00th=[   184], 50.00th=[   184], 60.00th=[   186],
     | 70.00th=[   188], 80.00th=[   192], 90.00th=[   196], 95.00th=[   202],
     | 99.00th=[   269], 99.50th=[   424], 99.90th=[104334], 99.95th=[112722],
     | 99.99th=[183501]
   bw (  MiB/s): min= 5445, max= 6517, per=100.00%, avg=6040.83, stdev=52.85, samples=480
   iops        : min=348537, max=417104, avg=386612.82, stdev=3382.19, samples=480
  lat (usec)   : 250=98.29%, 500=1.22%, 750=0.01%
  lat (msec)   : 50=0.01%, 100=0.34%, 250=0.14%, 500=0.01%
  cpu          : usr=15.82%, sys=53.15%, ctx=10706600, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=23193884,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6038MiB/s (6331MB/s), 6038MiB/s-6038MiB/s (6331MB/s-6331MB/s), io=354GiB (380GB), run=60023-60023msec