experiments/results/thesis/DPFS-NULL-pre/fio_randwrite_16k_32_8.out
"randwrite_16k_32_8": (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=io_uring, iodepth=32
...
fio-3.28
Starting 8 threads

"randwrite_16k_32_8": (groupid=0, jobs=8): err= 0: pid=140130: Wed Jul 19 03:42:32 2023
  write: IOPS=150k, BW=2348MiB/s (2462MB/s)(138GiB/60020msec); 0 zone resets
    slat (usec): min=2, max=737, avg=23.12, stdev=12.42
    clat (usec): min=29, max=860396, avg=1681.34, stdev=15177.60
     lat (usec): min=94, max=860422, avg=1704.62, stdev=15177.50
    clat percentiles (usec):
     |  1.00th=[   227],  5.00th=[   302], 10.00th=[   351], 20.00th=[   375],
     | 30.00th=[   388], 40.00th=[   396], 50.00th=[   404], 60.00th=[   412],
     | 70.00th=[   420], 80.00th=[   437], 90.00th=[   461], 95.00th=[   502],
     | 99.00th=[   668], 99.50th=[132645], 99.90th=[208667], 99.95th=[270533],
     | 99.99th=[367002]
   bw (  MiB/s): min= 1887, max= 2728, per=100.00%, avg=2348.62, stdev=20.05, samples=960
   iops        : min=120794, max=174608, avg=150311.53, stdev=1283.19, samples=960
  lat (usec)   : 50=0.01%, 100=0.01%, 250=2.05%, 500=92.94%, 750=4.17%
  lat (usec)   : 1000=0.03%
  lat (msec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.07%, 250=0.68%
  lat (msec)   : 500=0.06%, 750=0.01%, 1000=0.01%
  cpu          : usr=4.07%, sys=44.04%, ctx=3023200, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,9017702,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=2348MiB/s (2462MB/s), 2348MiB/s-2348MiB/s (2462MB/s-2462MB/s), io=138GiB (148GB), run=60020-60020msec